[{"t":"Simulation is defined as:","c":["A) A technique that uses computers","B) An approach for reproducing the process by which events by change and change are created in computer","C) A procedure for testing and experimenting on models to answer what if)), then so and so)) Types of questions","D) All of the above"],"a":3},{"t":"The purpose of simulation technique is to:","c":["A) Imitate a real world situation","B)Understand properties and operating characteristics of complex real-life problems","C) Reduce the cost of experiment on a model of real situation","D) All of the above"],"a":3},{"t":"The important step required for simulation approach in solving a problem is to:","c":["A)Test & validate the model","B)Design the experiment","C)Conduct the experiment","D) All of the above"],"a":3},{"t":"As simulation is not an analytical model, therefore the result of simulation must be viewed as:","c":["A)Unrealistic","B)Exact","C)Approximation","D)Simplified"],"a":2},{"t":"Which of the following is not the special purpose simulation language:","c":["A)BASIC","B)GPSS","C)GASP","D)SIMSCRIPT"],"a":0},{"t":"Simulation should be thought of as a technique for","c":["A) sampling the input and characterizing the uncertainty of the corresponding output)","B) obtaining a relatively inexpensive solution to a problem)","C) providing quick and dirty answers to complex problems)","D) none of the above"],"a":0},{"t":"While assigning random numbers in Monte Carlo simulation, it is","c":["A) not necessary to assign the exact range of random number interval as the probability","B) necessary to develop a cumulative probability distribution","C) necessary to assign the particular appropriate random numbers","D) all of the above"],"a":1},{"t":"The general purpose system simulation language","c":["A) requires programme writing","B) does not require programme writing","C) requires predefined coding forms","D) needs a set of equations to describe a system"],"a":2},{"t":"Few causes of simulation analysis failure are","c":["A) inadequate level of user participation","B) inappropriate levels of detail","C) incomplete mix of essential skills","D) all of the above"],"a":3},{"t":"The warm-up (initialization-bias) period in a steady-state simulation is typically handled by:","c":["A) Using a larger fixed time step","B) Deleting observations collected early in the run","C) Switching to a terminating model","D) Forcing the system to start at equilibrium"],"a":1},{"t":"Which of the following statements is INCORRECT regarding the advantages of simulation?","c":["A) Simulation is relatively easy to explain and understand)","B) Simulation guarantees an optimal solution)","C) Simulation models are flexible","D) A simulation model provides a convenient experimental laboratory for the real system)"],"a":1},{"t":"Special simulation languages are useful because they","c":["A) reduce programme preparation time and cost","B) have the capability to generate random variables","C) require no prior programming knowledge","D) all of the above"],"a":3},{"t":"Large complicated simulation models are appreciated because","c":["A) their average costs are not well-defined","B) it is difficult to create the appropriate events","C) they may be expensive to write and use as an experimental device","D) all of the above"],"a":2},{"t":"Simulation should not be applied in all cases because it","c":["A) requires considerable talent for model building and extensive computer programming efforts","B) consumes much computer time","C) provides at best approximate solution to problem","D) all of the above"],"a":3},{"t":"Which of the following statements are NOT true of simulation?","c":["A) Simulation model cannot prescribe what should be done about a problem","B) Simulation models can be used to study alternative solutions to a problem","C) Simulation models the behaviour of a system","D) The equations describing the operating characteristics of the system are known "],"a":3},{"t":"Select the valid reasons for using simulation)","c":["A)  Relationship between the variables is nonlinear","B) Optimized solutions are obtained","C)  Conduct experiments without disrupting the real system","D)  Answers A and C "],"a":3},{"t":"Monte Carlo simulation gets its name from which of the following?","c":["A) Data collection","B) Model formulation","C)  Random-number assignment ","D) Analysis"],"a":2},{"t":"Simulation models can be used to obtain operating characteristic estimates in less time than with the real system using a feature of simulation called: ","c":["A) Microseconds","B) Warp speed","C) Time compression ","D) None of the above"],"a":2},{"t":"Which of the following statistical methods are commonly used to analyze simulation results?","c":["A) Regression analysis ","B) Secondary Data only","C) Both Primary and Secondary Data","D) None of the above"],"a":0},{"t":"A test accurately indicates an employee’s scores on a future criterion (e)g), conscientiousness))  What kind of validity is this?","c":["A) Predictive validity","B) Concurrent validity","C) Content validity","D) Construct validity"],"a":0},{"t":"All simulations involve:","c":["A) The passage of time","B) A model on a computer","C) An imitation of a system","D) A visual display"],"a":2},{"t":"The simulations described in the book are used for:","c":["A)Understanding a system","B) Understanding and improving a system","C) Improving a system","D) None of the above"],"a":1},{"t":"Which of the following systems can be simulated?","c":["A)Transportation systems","B) Manufacturing systems","C) Health systems","D)All of the above"],"a":3},{"t":"What software is likely to be needed for a simulation study?","c":["A) Spread sheet software","B) Simulation package","C) Statistical software","D) None of the above"],"a":1},{"t":"A simulation uses the logical relationships and mathematical expressions of the","c":["A) Real system","B) Computer model","C) Performance measures","D) Inferences"],"a":1},{"t":"…is considered to be a numerical computation technique used in conjunction with dynamic mathematical models)","c":["A) Analysis","B) System simulation","C) Dynamic computation","D) None of the above"],"a":1},{"t":"Which system/model applies computational procedures to solve equations:","c":["A) Dynamic Model","B) Static Model","C) Analytical Model","D) Numerical Model"],"a":3},{"t":"Which system/model applies deductive reasoning of mathematical theory to solve a model:","c":["A) Dynamic Model","B) Static Model","C) Analytical Model ","D) Numerical Model"],"a":2},{"t":"Which model follows the changes over time that results from the system activities:","c":["A) Dynamic Model ","B) Static Model","C) Analytical Model","D) Numerical Model"],"a":0},{"t":"Which model can only show the values that system attributes take when the system is in balance:","c":["A) Dynamic Model","B) Static Model","C) Analytical Model","D) Numerical Model"],"a":1},{"t":"Mathematical models are based on:","c":["A) Analogy between such systems as mechanical and electrical","B) Use symbolic notation and mathematical equations to represent a system","C) All of the above","D) None of the above"],"a":1},{"t":"Physical models are based on:","c":["A) Analogy between such systems as mechanical and electrical ","B) Use symbolic notation and mathematical equations to represent a system","C) All of the above","D) None of the above"],"a":0},{"t":"In system modeling, the task of deriving a model of a system may be divided broadly into two subtasks:","c":["A) Establishing the model structure","B) Supplying the data)","C) Both of above ","D) None of the above"],"a":2},{"t":"Which one of the following is false about model:","c":["A) Model is the body of information about a system gathered for the purpose of studying the system)","B) Since the purpose of study is varying, there is no unique model for a system)","C) Both of above are false","D) None of the above"],"a":0},{"t":"In Continuous system, changes are:","c":["A) Predominantly continuous","B) Predominantly discrete","C) Depend on the system","D) None of the above"],"a":0},{"t":"In Discrete system, changes are:","c":["A) Predominantly continuous","B) Predominantly discrete ","C) Depend on the system","D) None of the above"],"a":1},{"t":"System analysis, System design and system postulation are the examples of:","c":["A) Types of system","B) Types of system study","C) Types of entities","D) Type of environment"],"a":1},{"t":"Where the outcome of the activity can describe completely in terms of its input, the activity is said to be:","c":["A) Deterministic","B) Stochastic","C) Endogenous","D) Exogenous"],"a":0},{"t":"A system which does have exogenous activity is said to be:","c":["A) Closed System","B) Open system","C) Both of above","D) None of the above"],"a":1},{"t":"A system with no exogenous activity is said to be","c":["A) Closed System","B) Open system","C) Both of above","D) None of the above"],"a":0},{"t":"In a Bank system, what is customer","c":["A) Entity","B) Activity","C) Environment","D) None of the above"],"a":0},{"t":"A simple market model is an example of:","c":["A) Static Physical Model","B) Dynamic Physical Mode","C) Static Mathematical Model","D) Dynamic Mathematical Model"],"a":2},{"t":"Factory is an example of:","c":["A) System","B) Attribute","C) Activity","D) Environment"],"a":0},{"t":"System is defined as:","c":["A) aggregation or assemblage of objects ","B)  Definition of Object","C)  B bot not A","D) none of the above"],"a":0},{"t":"Block building principle of the system modeling says that:","c":["A) The description of the system should be organized in a series of blocks)","B) The description of the system should not be organized in a series of blocks)","C)There should be no clear distinction between the subsystems of the system)","D) None of the above)"],"a":0},{"t":"Which of the following separate system and system environment:","c":["A) Acitvities","B) Boundary","C) Entity","D) All of the above"],"a":1},{"t":"Advance, Link, Mark and Queue blocks are used in which language:-","c":["A) Simscript","B) GPSS","C) Both of above","D) None of the above"],"a":1},{"t":"Which of the following is not a simulation language:","c":["A) GPPS","B) Simscript","C) Simula","D) all of the above"],"a":0},{"t":"Which of the following is simulation language:-","c":["A) Java","B) GPSS","C) Javascript","D) None of the above"],"a":1},{"t":"Speed and Distance in Traffic system are:-","c":["A) Entities","B) Attributes","C) Activities","D) Environment"],"a":1},{"t":"Messages in Communication system is:","c":["A) Entity","B) Attribute","C) Activity","D) Environment"],"a":0},{"t":"Depositing in Bank system is:","c":["A) Entity","B) Attribute","C) Activity","D) Environment"],"a":2},{"t":"Suspension model of an automobile wheel is an example of:","c":["A) Static Physical Model","B) Dynamic Physical Model","C) Static Mathematical Model","D) Dynamic Mathematical Model"],"a":1},{"t":"System design is a:","c":["A)To produce a system that meets some specifications","B) To understand how an existing system or a proposed system operates","C) To produce a system in which behavior is known but the process is not known)","D) None of the above)"],"a":0},{"t":"System analysis is a:","c":["A) To produce a system that meets some specifications)","B) To understand how an existing system or a proposed system operates","C) To produce a system in which behavior is known but the process is not known)","D) None of the above"],"a":1},{"t":"Where the effects of the activity vary randomly over various possible outcomes, the activity is said to be:","c":["A)  Deterministic","B) Stochastic","C) Endogenous","D) Exogenous"],"a":1},{"t":"In a Corporate model, what is/are main segment/segments?","c":["A) Environment","B) Plant/Physical plant","C)  Management","D) All of the above"],"a":3},{"t":"Principle/principles used in modeling:","c":["A) Block-building","B) Relevance","C) Accuracy","D) All of the above"],"a":3},{"t":"In Communication system, what is \"\"Transmitting\"\":","c":["A) Entity","B) Activity ","C) Environment","D)None of the above)"],"a":1},{"t":"Oscillator Model is an example of:","c":["A) Static Physical Model","B) Dynamic Physical Model","C) Static Mathematical Model","D) Dynamic Mathematical Model"],"a":3},{"t":"Traffic, Bank, and Supermarket are the examples of:","c":["A) Attribute","B) System","C) Activity","D) Environment"],"a":1},{"t":"System postulation is a:","c":["A) To produce a system that meets some specifications)","B) To understand how an existing system or a proposed system operates)","C) To produce a system in which behavior is known but the process is not known)","D) None of the above)"],"a":2},{"t":"DNA molecule Model or ionic model is an example of:","c":["A) Static Physical Model","B) Dynamic Physical Model","(C) Static Mathematical Model","D) Dynamic Mathematical Model"],"a":0},{"t":"The following is not an advantage of simulation:","c":["A) It allows for the study of what-if questions","B) Each simulation model is unique","C) It allows the study of interaction of components or variables to determine which areimportant)","D) It allows time compression)"],"a":1},{"t":"Which of the following is a way of dealing with a validation problem when the computer simulation yields results that you suspect are incorrect?","c":["A) Run the computer program again with more or fewer iterations)","B) Simulate present conditions and compare results with the existing system","C) Approach the problem with a mathematical model instead","D) Use a different simulation model to try to verify the mistakes"],"a":1},{"t":"Which of the following is not one of the desirable features of simulation software listed in the textbook?","c":["A)  Being capable of being used interactively","B) Being a complete and accurate model of reality","C) Having building blocks with built-in commands","D) Allow modules to be built and then connected"],"a":1},{"t":"Which of the following are viewed as advantages of simulation in operations management decision making?","c":["A) a simulation can be used in training courses as though it were a game","B) a significant amount of computer time can be utilized running simulations","C) The technique of simulation requires innovation as it lacks a standardized approach","D) Simulation may be equally precise but less accurate than a mathematical analysis"],"a":0},{"t":"In a simulation study, after defining the problem and constructing the simulation model, the immediate next major phase of the study is which of the following?","c":["A) Run the simulation","B) Specify values of variables and parameters","C) Evaluate results","D) Validation"],"a":1},{"t":"Determining starting conditions is a major tactical decision in simulation analysis) Which of the following is a way to cope with this problem?","c":["A)  Discard data generated during the early parts of a run","B) Select starting conditions that you know are realistic","C) Select starting conditions randomly","D)  Measure the actual values of the system you are trying to simulate"],"a":0},{"t":"In the context of a simulation study, which of the following refers to testing the computer simulation program to ensure that the simulation is correct?","c":["A) Validation","B) Confirmation","C) Substantiation","D) Calibration"],"a":0},{"t":"Why is it important to know about probability functions?","c":["A) Probability provides information about the likelihood that something will happen)","B) used to model timings and behaviour of event)","C) B but not A","D) none of the above"],"a":0},{"t":"Why random numbers used in simulation?","c":["A) Random numbers are used to model timings and behaviour of event)","B) used to model timings and behaviour of event) ","C) A but not B","D) none of above"],"a":1},{"t":"Calibration is:","c":["A) is the iterative process of comparing the model with real system","B) revising the model if necessary","C) comparing again, until a model is accepted (validated))","D) B but not C"],"a":0},{"t":"What are the types of simulation with regard to output analysis?","c":["A) Finite-Horizon (Terminating)","B) Steady-State simulations)","C) A but not B","D) A and B"],"a":3},{"t":"Characteristics of a queuing system that impact its performance for example, queuing requirements of a restaurant will depend upon factors like:","c":["A) How do customers arrive in the restaurant?","B) How much time do customers spend in the restaurant?","C) How many tables does the restaurant have for servicing customers?","D) All of above"],"a":3},{"t":"Which model allows system state to change any time?","c":["A) continuous-event model","B) Commercial Model","C) A and B","D) All of the above"],"a":0},{"t":"What are the examples of queuing system?","c":["A) bank-teller service","B) computer systems","C) manufacturing systems","D) All of the above"],"a":3},{"t":"input modelling is:","c":["A) the practice of selecting probability distributions to represent such random input processes","B) the practice of selecting probability distributions to represent such random output processes","C) both a and B","D) all of the above"],"a":0},{"t":"What is the function of simulation clock?","c":["A) is the variable within a simulation model that gives the current value of the simulated time)","B) is the variable cause changes in another variable)","C) order of the values is significant but difference between those values are unknown","D) All of the above"],"a":0},{"t":"Which of the following is a key factor to consider for the \"\"Runtime Environment\"\" when selecting simulation software?","c":["A) Vendor support and training","B) Ability to import CAD drawings","C) Execution speed and interactive debugger","D) Standardized reporting features"],"a":2},{"t":"In simulation studies, “verification” means:","c":["A) Ensuring the model represents the real system","B) Ensuring the computer program correctly implements the model","C) Proving the model’s outputs are optimal","D) Calibrating input distributions"],"a":1},{"t":"Which of the following is NOT a common modeling element in simulation software?","c":["A) Entities","B) Attributes","C) Compilers","D) Resources"],"a":2},{"t":"Which modeling approach involves identifying entities (or processes) that are created and flow   through the system, and is now used by most modern simulation software?","c":["A) Event-Scheduling approach","B) Object-Oriented approach","C) Process-Interaction approach","D) Algorithmic approach"],"a":2},{"t":"According to the modern classification, general-purpose simulation packages are designed for specific applications like manufacturing or call centers, while application-oriented packages are flexible for any kind of system.","c":["A) False","B) True"],"a":0},{"t":"What is a major pitfall of simulation if an analyst runs a complex model only once and makes decisions based on that single output?","c":["A) Misuse of animation","B) Treating the output values as true values and not estimates","C) Using arbitrary distributions","D) Failure to understand sources of randomness"],"a":1},{"t":"Which of the following is a key characteristic of a Discrete-Event Simulation?","c":["A) It represents the system at a single point in time","B) The clock always advances by a fixed, predetermined amount","C) The state variables change instantaneously at separate points in time","D) It cannot have any random components"],"a":2},{"t":"To simulate the roll of a single fair die using a continuous random variable U (0,1), which formula is correct?","c":["A) U + 1","B) 6 * U","C) FLOOR(6 * U) + 1","D) 6 * U + 1"],"a":2},{"t":"The main reason most real-world simulation examples are complicated is that they often involve both a complex input model that requires estimation and a dynamic process that must be emulated","c":["TRUE","FALSE"],"a":0},{"t":"system where the state variables change continuously over time, like the water level in a dam, is best described as a discrete system.","c":["FALSE","TRUE"],"a":0},{"t":"In queueing-system simulation, what does “interarrival time” mean?","c":["A) The time between two consecutive customer arrivals","B) The time a customer spends in service","C) The time since the simulation started","D) The average service time"],"a":0},{"t":"When you face a complex queueing network that’s hard to analyze with simple assumptions, what is the most practical action?","c":["A) Use simulation to study performance","B) Oversimplify the model even if it distorts behavior","C) Ignore dependencies between components","D) Always assume all times are normally distributed"],"a":0},{"t":"Which of the following is a key advantage of simulation?","c":["A) It always provides a closed-form solution","B) It needs no real data","C) It can study long periods efficiently via “time compression”","D) One run yields a guaranteed, exact result"],"a":2},{"t":"Which of the following is a drawback of simulation?","c":["A) Each run produces estimates affected by randomness","B) It prevents sensitivity analysis","C) It cannot represent more than one queue","D) It only works for very small systems"],"a":0},{"t":"Which of the following is a common pitfall when building a simulation model?","c":["A) Failing to state study objectives clearly","B) Using a reliable random-number generator","C) Documenting all assumptions","D) Verifying and validating the model afterward"],"a":0},{"t":"A/An…....is any set of interrelated components acting togather to achieve a common objective.","c":["A) System","B) Environment","C) Activity","D) Entity"],"a":0},{"t":"…...... Is a collection of variables that describe the system in any time.","c":["A) Activity","B) Event","C) state","D) Entity"],"a":2},{"t":"systems can be classified based on time frames as:","c":["A) Discrete","B) Continous","C) Hybrid","D) all of above"],"a":3},{"t":"An object of interest in the system: Machines in factory is?","c":["A) Attribute","B) Entity","C) Event","D) Exogenous"],"a":1},{"t":"Activities and events occuring with the system is?","c":["A) Exogenous","B) Endogenous","C) State","D) Activity"],"a":1},{"t":"In Verification, the computational model should be consistent with …...","c":["A) The real system","B) The specification model","C) The collected data","D) The graphical outputs"],"a":1},{"t":"In the event-scheduling world view, the model is defined in terms of entities or objects.","c":["TRUE","FALSE"],"a":1},{"t":"An event is an instantaneous occurrence that changes the state of a system.","c":["TRUE","FALSE"],"a":0},{"t":"........ is a record of an event to occur at the current or future time (type and time).","c":["A) Event List","B) Event Notice","C) System State","D) Attributes"],"a":1},{"t":"The specification model is usually represented on paper.","c":["TRUE","FALSE"],"a":0},{"t":"When is simulation NOT appropriate to use?","c":["A)When the problem can be solved analytically","B)When the system is too complex like human behavior","C)When direct experiments are easier","D) all of above"],"a":3},{"t":"Which of the following is an advantage of simulation?","c":["A) It disrupts real system operation","B) It allows testing new hardware and layouts without real acquisition ","C)It avoids the need for models","D) It reduces time always"],"a":1},{"t":"Simulation is the appropriate tool when:","c":["A)  The problem can be solved by common sense","B)  Studying internal interaction of a subsystem with complex system","C)Cost exceeds savings","D) Resources are not available"],"a":1},{"t":"One of the benefits of virtual environments in simulation is:","c":["A)  Ignoring system behavior","B)  Training tools ","C)Avoiding realism","D)Eliminating interaction"],"a":1},{"t":"Simulation outputs may include:","c":["A) Ignoring metadata","B)Snapshots of some states ","C)Removing all variables","D)Excluding statistics"],"a":1},{"t":"What does the expected average delay in queue represent","c":["A)The total number of customers in the system","B)The average waiting time in the queue (excluding service time) ","C)The maximum queue length observed","D) The server’s idle time"],"a":1},{"t":"How is the expected average number of customers in the queue calculated?","c":["A) By counting all arrival and departure events","B) By dividing total service times by number of customers","C) By area under Q(t) divided by T(n) ","D) By subtracting arrival times from departure times"],"a":2},{"t":"What does B(t) indicate in the model?","c":["A) Number of customers in queue at time t","B) Server status: 1 if busy, 0 if idle ","C) Customer arrival time at t","D) A probability distribution"],"a":1},{"t":"In the program logic, what are the event types defined?","c":["A) 1 for initialization, 2 for reporting","B) 1 for waiting, 2 for service","C) 1 for arrival, 2 for departure ","D) 1 for distribution, 2 for variance"],"a":2},{"t":"From which distribution are interarrival and service times generated?","c":["A) Normal distribution","B) Exponential distribution ","C) Uniform distribution","D) Binomial distribution"],"a":1},{"t":"What is a \"\"Discrete Event Model\"\"?","c":["A) A model where time flows continuously.","B) A model where changes happen at specific moments in time.","C) A model that only uses pictures and animations.","D) A model that is very simple and easy to build."],"a":1},{"t":"The \"\"System State\"\" is:","c":["A) The speed of the simulation clock.","B) A list of all future events.","C) The information that describes the system at any time.","D) The physical location of the computer running the simulation."],"a":2},{"t":"What is the key conceptual difference between an \"\"Activity\"\" and a \"\"Delay\"\" as defined in the terminology?","c":["A) An activity involves an entity, while a delay involves a resource.","B) An activity's duration is known when it begins, while a delay's duration is not known until it ends.","C) An activity changes the system state, while a delay does not.","D) An activity is scheduled on the FEL, while a delay is not."],"a":1},{"t":"What is an \"\"Event\"\"?","c":["A) A long period of time where nothing happens.","B) Something that takes a very long time to finish.","C) An instant happening that changes the system.","D) A list of customers waiting in line."],"a":2},{"t":"The Future Event List (FEL) is a list that:","c":["A) Keeps track of all the customers who have left the system.","B) Holds past events that have already happened.","C) Contains future events sorted by when they will happen.","D) Describes the attributes of every server."],"a":2},{"t":"What is the core principle of Discrete-Event Simulation (DES)?","c":["A) State changes occur continuously over time.","B) State changes occur only at instantaneous events.","C) It requires solving differential equations.","D) It is only used for manufacturing processes."],"a":1},{"t":"What is the key advantage of the next-event time advance mechanism?","c":["A) It models continuous processes.","B) It skips inactive periods, improving efficiency.","C) It is simpler to implement.","D) It guarantees higher accuracy."],"a":1},{"t":"What is a key drawback of fixed-increment time advance?","c":["A) Inefficient processing of inactive periods","B) Inability to handle random events","C) Excessive complexity","D) Requires real-time synchronization"],"a":0},{"t":"How does the next-event time advance mechanism move the simulation clock?","c":["A) It increases the clock by a fixed time step at every interval.","B) It jumps directly to the time of the next imminent event.","C) It synchronizes with the real-time duration of the simulation.","D) It requires user input to decide the next time step."],"a":1},{"t":"Which component of a DES program is responsible for determining the next event and advancing the simulation clock?","c":["A) Event Routine","B) Timing Routine","C) Initialization Routine","D) Report Generator"],"a":1},{"t":"Which of the following represents Decision Making Under Certainty?","c":["A) When the probabilities of results are completely unknown","B) When each alternative has a definite and clear outcome ","C) When the decision depends on uncertain future expectations","D) When there is risk and multiple possible outcomes"],"a":1},{"t":"Mathematical models are characterized by:","c":["A) Building expensive physical prototype","B) Using symbols and equations to represent a system","C) Focusing only on static variables","D) Ignoring functional relations between variables"],"a":1},{"t":"Which model level is highly abstract and identifies important variables?","c":["A) Specification Model","B) Computational Model","C) Conceptual Model","D) Simulation Model"],"a":2},{"t":"Which of the following is a disadvantage of simulation?","c":["A) Helps discover new ways to improve systems","B) Can be used as a low-cost training tool","C) Building the model may require special training and high cost ","D) Helps identify the most important variables"],"a":2},{"t":"The Monte Carlo Method is mainly used for:","c":["A) Solving simple problems with limited variables","B) Simulating problems involving random processes","C) Building electrical circuits to represent problem","D) Ignoring probabilities and focusing only on fixed values"],"a":1},{"t":"Which of the following is a major advantage of simulation","c":["A) It allows experimentation without disturbing the real system ","B) A) It guarantees the optimal solution every tim","C) It eliminates the need for data collectio","D) It completely removes uncertainty in decision making"],"a":0},{"t":"Which property must random numbers satisfy in simulation","c":["A) They should always follow a normal distributio","B) They must be uniformly distributed and independent ","C) They should repeat after every 100 number","D) They must only take integer values"],"a":1},{"t":"What are the two key properties that random numbers must satisfy in simulation?","c":["A) Normality and symmetr","B) Linearity and periodicit","C) Uniformity and independence ","D) Stability and correlatio"],"a":2},{"t":"Why are random numbers generated in simulations called pseudo-random?","c":["A) Because they cannot be used in large simulation","B) Because they are generated using deterministic algorithms, not truly random ","C) Because they always follow a fixed cycle of 100 number","D) Because they are produced by hardware onl"],"a":1},{"t":"Which of the following is a disadvantage of pseudo-random number generation","c":["D) Numbers work only on one computer","B)Numbers can be replicate","C) Numbers are generated too quickl","D) Numbers may not be perfectly uniform or independent "],"a":3},{"t":"When an event occurs in a simulation, what actions must be taken?","c":["A) Only modify the data.","B) Delete the event without changing anything.","C) The system stops working.","D) Some actions are taken, the system state changes, and the FEL needs to be updated"],"a":3},{"t":"Which variance-reduction technique uses negatively correlated streams to reduce","c":["A) Control variates","B) Common random numbers","C) Antithetic variates","D) Importance sampling"],"a":2},{"t":"What is the function of the Event-scheduling/time advance algorithm?","c":["A) Adding new events only.","B) Deleting events that occurred in the past.","C) Removing the imminent event from the Future Event List (FEL) and handling other events that occur simultaneously","D) Changing the timing of all events."],"a":2},{"t":"What are the basic components of a Queuing System?","c":["A) Nature of departures.","B) System capacity.","C) All of the above.","D) Service time."],"a":2},{"t":"Which element is considered part of the queuing system?","c":["A) Operation time.","B) Number of servers.","C) Queuing discipline.","D) Number of employees."],"a":2},{"t":"What does the acronym FEL stand for in the context of Queuing System simulation?","c":["A) Final Exit Log","B) First Event Loop","C) Future Event List","D) Future Event Location."],"a":2},{"t":"In the real world, there are many causes for randomness.","c":["TRUE","FALSE"],"a":0},{"t":"For the random case, random variables can be characterized using the following statistical measures:","c":["A) Mean (statistical average), variance, probability density function","B) Median, standard deviation, range","C) All of the above","D) None of the above"],"a":2},{"t":"Simulation heavily depends on probability theory and statistics.","c":["FALSE","TRUE"],"a":1},{"t":"What is the definition of an experiment in the context of statistics and simulation?","c":["A) Observation of results (System Output)","B) A process that always gives the same results","C) A process whose results can never be predicted","D) Complex mathematical calculations"],"a":2},{"t":"What is the function p(x<sub>i</sub>) called in the context of the probability distribution of random variable X?","c":["A) Probability density function (pdf)","B) Probability mass function (pmf)","C) Cumulative distribution function (cdf)","D)  Expectation function"],"a":1},{"t":"Component of a system:","c":["A) Entity  ","B) Attribute","C) Event","D) Activity"],"a":0},{"t":"Which of the following is an example of a continuous system?  ","c":["A) Traffic movement at a signal","B) Water flow behind a dam  ","C) Attendance recording in class","D) Student grade collection"],"a":1},{"t":"What defines the boundaries of a system and separates it from its environment?  ","c":["A) Output","B) Input","C) Boundary  ","D) Event"],"a":2},{"t":"What does the \"\"Attribute\"\" mean in system components?  ","c":["A) The action performed by the entity","B) A description of the entity’s properties like color and speed  ","C) Interaction between entities","D) Sudden change in the system state"],"a":1},{"t":"In system models, which is an example of a system affected by an external environment?  ","c":["A) A closed factory system","B) A closed system unaffected by external factors","C) A transportation system affected by traffic congestion  ","D) A system that uses only fixed data"],"a":2},{"t":"Concepts in Discrete-Event simulation","c":["A) Activity","B) Delay","C) Clock","D) All"],"a":3},{"t":"Q(t) is ","c":["A) Number of customers in line","B) Status of server 0 1","C) All","D) Null"],"a":0},{"t":"FEL","c":["A) Future event list","B) Future list event","C) All","D) Null"],"a":0},{"t":"In a simulation, the stop time (TE) is:","c":["A) Always fixed before the start of the simulation.","B) Determined by the simulation itself","C) Not related to the simulation run length","D) Randomly chosen during execution."],"a":1},{"t":"When constructing a simulation table:","c":["A) Rows repetitions of system operation","B) Columns represent inputs and responses","C) Both","D) No one"],"a":2},{"t":"In Activities inter arrival time is","c":["A) 1 to 8 min","B) 7 to 10 min","C) 1 to 9 min","D) 2 to 8 min"],"a":0},{"t":"In Activities service time is","c":["A) 1 to 6 min","B) 7 to 10 min","C) 1 to 9 min","D) 2 to 8 min"],"a":0},{"t":"Each simulation model must be customized to target system","c":["TRUE","FALSE"],"a":0},{"t":"The simulation clock represents the current value of simulated time.","c":["FALSE","TRUE"],"a":1},{"t":"Statistical counters are used to accumulate quantities for output in a simulation model.","c":["FALSE","TRUE"],"a":1},{"t":"In Monte Carlo the problem under study that is to be simulated is converted to analogue so that it is easy to process.","c":["TRUE","FALSE"],"a":1},{"t":"Monte Carlo method is used to address various types of problems involving random processes","c":["TRUE","FALSE"],"a":0},{"t":"In Decision-making under risk the decision maker is certain of the outcome of each decision alternative","c":["TRUE","FALSE"],"a":1},{"t":"Simulation of decision under risk include probabilistic elements in their behavior ","c":["TRUE","FALSE"],"a":0},{"t":"The success of managers in their work depends on the quality of the decisions they make when facing the problems and changing conditions","c":["TRUE","FALSE"],"a":0},{"t":"According to the steps for developing simulation models, what is always the initial step to be taken?","c":["A) Collecting data and starting to process system data","B) Identifying the problem with an existing system or defining the requirements of a proposed system","C) Validating the model by comparing its performance with real-world conditions"],"a":1},{"t":"If a system is complex and its problems are difficult to solve using traditional mathematical methods, what is a useful approach for developing its model?","c":["A) Simplified probability theory","B) Numerical computer-based simulation","C) Simple analytical methods that require a few parameters"],"a":1},{"t":"One of the fundamental difficulties associated with simulation results is that they can be","c":["A) Always easy to understand and generalize to different systems","B) Difficult to translate and interpret, requiring specialized experts to understand them","C) So simple that they do not require any interpretation"],"a":1},{"t":"Within the steps for performing simulation analysis, which step involves visually depicting the progress of the simulation process?","c":["A) Developing a flowchart","B) Choosing input variables and creating entities","C) Determining output variables"],"a":0},{"t":"We use scatter plot to determine the relationships between:","c":["A) Variables ","B) Outputs","C) A&B"],"a":0},{"t":"Which type of model describes a system whose state changes continuously over time, such as water flow in a tank?","c":["A) Analytical model","B) Discrete model","C) Continuous model"],"a":2},{"t":"Validation means is the model built correctly (no logical errors in your simulation) ","c":["True","False "],"a":1},{"t":"It answer the question  (Is the model built correctly ?)","c":["A) Validation","B) Verification ","C) None"],"a":1},{"t":"Why we need simulation:","c":["A) It may be too difficult, risky, or expensive to observe a real, operational system","B) Parts of the system may not be observable (e.g., internals of a silicon chip or biological system)","C) A&B "],"a":2},{"t":"It characterises the quantity and the nature of the system inputs :","c":["A) Benchmark","B) The Workload ","C) None"],"a":1},{"t":"One major advantage of Digital Twins in modeling and simulation is:","c":["A) Eliminating the need for real data","B) Monitoring and improving system performance in real time","C) Replacing all traditional mathematical models","D) Avoiding any maintenance cost"],"a":1},{"t":"Which of the following represents an important use of simulation in transportation?","c":["A) Studying the impact of traffic congestion on travel times","B) Increasing fuel prices to reduce demand","C) Replacing all vehicles with public transport","D) Eliminating human errors completely"],"a":0},{"t":"Artificial Intelligence is mainly applied in simulation to:","c":["A) Add random noise only","B) Improve prediction accuracy and speed of scenario analysis","C) Reduce the use of computers","D) Eliminate the need for data collection"],"a":1},{"t":"In industrial simulation, the main goal of \"\"What-if analysis\"\" is:","c":["A) Forecasting the weather","B) Evaluating system performance under different conditions","C) Testing software before installation","D) Reducing the time of theoretical studies"],"a":1},{"t":"When building an effective simulation model, one of the most important steps is:","c":["A) Ignoring data validation","B) Relying on guesses for parameter input","C) Performing Validation and Verification","D) Using one model for all systems"],"a":2},{"t":"What is the main difference between modeling and simulation?","c":["A) Modeling tests hypotheses, while simulation creates the model","B) Modeling focuses on describing the system, while simulation focuses on system behavior","C) Modeling focuses on data, while simulation focuses on visuals","D) There is no difference between them"],"a":1},{"t":"One of the primary uses of modeling and simulation at the NIH campus is to:","c":["A) Increase the number of staff in parking lots","B) Determine the time needed to evacuate the campus","C) Expand the size of medical buildings","D) Reduce the number of visitors to the center"],"a":1},{"t":"Which of the following scenarios was analyzed in the South Drive gate closure study?","c":["A) Redirecting all traffic to the North Gate only","B) Splitting traffic between the Center and Lincoln at 50/50","C) Closing all gates simultaneously","D) Using trains instead of buses"],"a":1},{"t":"What is the main benefit of using stochastic modeling?","c":["A) Reducing design execution time","B) Increasing number of staff","C) Representing uncertainty and randomness in the system","D) Enhancing the quality of visual diagrams"],"a":2},{"t":"In the context of improving the NIH shuttle bus system through simulation, the main goal is:","c":["A) Increasing the number of buses without restrictions","B) Providing entertainment for drivers","C) Reducing operating costs by aligning capacity with demand","D) Cutting the number of bus stops in half"],"a":2},{"t":"The inverse-transform method is most directly applicable to generating:","c":["A) Poisson processes","B) Any distribution with a closed-form CDF inverse","C) Only normal random variables","D) Only discrete distributions"],"a":1},{"t":"In an M/M/1 queue under stability, Little’s Law states:","c":["A) L = λ / μ","B) L = λW","C) W = μ / λ","D) Lq = λ / (μ − λ)"],"a":1},{"t":"A queue discipline that allows preemption based on class is called:","c":["A) FCFS","B) LCFS","C) Priority with preemption","D) Processor sharing"],"a":2},{"t":"In output analysis, independent replications are primarily used to:","c":["A) Reduce bias in point estimates","B) Construct confidence intervals assuming independence","C) Shorten the warm-up period","D) Force normality of outputs"],"a":1},{"t":"The most common arrival process assumption in basic queuing simulations is:","c":["A) Deterministic arrivals","B) Poisson arrivals","C) Uniform arrivals","D) Batch arrivals only"],"a":1},{"t":"A resource’s “utilization” in a simulation is defined as the fraction of time it is:","c":["A) Idle","B) Busy","C) Blocked","D) Under maintenance"],"a":1},{"t":"Which input distribution often models service times with “memoryless” property?","c":["A) Normal","B) Exponential","C) Gamma (k>1)","D) Triangular"],"a":1},{"t":"A customer who decides not to join the queue after seeing its length is exhibiting:","c":["A) Reneging","B) Jockeying","C) Balking","D) Preempting"],"a":2},{"t":"In a DES engine, the primary data structure for scheduling is typically a:","c":["A) FIFO list","B) Priority queue keyed by event time","C) Hash table of entities","D) Stack of pending actions"],"a":1},{"t":"Common Random Numbers (CRN) are used to:","c":["A) Make alternative systems less correlated","B) Induce positive correlation to reduce the variance of differences","C) Randomize seeds across replications","D) Remove the need for replications"],"a":1},{"t":"The batch-means method is mainly used for:","c":["A) Input-model fitting","B) Removing warm-up bias","C) Estimating steady-state variance from a long run","D) Validating the conceptual model"],"a":2},{"t":"In a terminating simulation, the appropriate performance measures are typically based on:","c":["A) Long-run time averages","B) Steady-state limits","C) A single replication from time 0 to a fixed stopping time/event","D) Infinite-horizon behavior"],"a":2},{"t":"A “bottleneck” in a manufacturing simulation is best identified by:","c":["A) Highest utilization and longest average queue before the station","B) Lowest variability in processing time","C) Shortest setup time","D) Fewest operators assigned"],"a":0},{"t":"The primary purpose of setting a fixed random-number seed before a run is to:","c":["A) Speed up the simulation","B) Ensure reproducibility of results","C) Increase output randomness","D) Improve model validity"],"a":1},{"t":"Importance sampling in simulation primarily aims to:","c":["A) Increase estimator bias","B) Reduce variance by sampling rare but influential events more often","C) Guarantee normality of outputs","D) Avoid using probability distributions"],"a":1}]